Revit 2027 API
DirectShapeType.ResetExternallyTaggedGeometry Method
 Removes all of the externally tagged geometry in this DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetExternallyTaggedGeometry()
Public Sub ResetExternallyTaggedGeometry
public:
void ResetExternallyTaggedGeometry()
member ResetExternallyTaggedGeometry : unit -> unit
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace